import re

# 電話番号の正規表現
phone_regex = re.compile(r'''(
    (0\d{1,4}|\(0\d{1,4}\))                      # 市外局番
    (\s|-)?                                      # 区切り
    (\d{1,4})                                    # 市内局番
    (\s|-)                                       # 区切り
    (\d{4})                                      # 加入者番号
    (\s*(内線|\(内\)|\(内.{1,3}\))\s*(\d{2,5}))? # 内線番号
    )''', re.VERBOSE)

# テスト
str = '氏名:秀和太郎 住所:東京都中央区 電話番号: (001)5555-6767 (内線)365'
pho = phone_regex.search(str)
print(pho.group())
