import openpyxl

book  = openpyxl.Workbook()   # ブックを生成
sheet = book.active           # アクティブなシートを取得

rows = [
    ('月', '商品A', '商品B'), # タイトル行と12行のレコードのタプルのリスト
    (1,  30, 35),
    (2,  10, 30),
    (3,  40, 60),
    (4,  50, 70),
    (5,  20, 10),
    (6,  30, 40),
    (7,  50, 30),
    (8,  65, 30),
    (9,  70, 30),
    (10, 50, 40),
    (11, 60, 50),
    (12, 65, 55),
]

for row in rows:               # 行数のぶんだけ繰り返す
    sheet.append(row)          # ワークシートに追加する

book.save('月別売上.xlsx')     # ブックを保存
